app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('3a3c57efc94e251fa25819989de1b79953b45341', '2009-02-24 17:49:08', '213679c29a349210ad2fd01e0185bb351ee3394a', NULL, '2009-02-24 17:49:08', NULL, 'mick', 'faivrem@gmail.com')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.company_id = self.current_user.company_id
    @user.save